let html = `118.31.169.16(公)

118.31.168.220(公)
10.135.196.246(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0m
node201705
 
华东 1 可用区 E	
101.37.87.143(公)
10.29.194.37(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vloqzy
node201705
 
华东 1 可用区 E	
101.37.16.101(公)
10.29.187.161(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor05
node201705
 
华东 1 可用区 F	
101.37.254.39(公)
10.135.196.247(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vloqzz
node201705
 
华东 1 可用区 B	
118.31.113.192(公)
10.46.225.205(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0q
node201705
 
华东 1 可用区 B	
118.31.112.78(公)
10.46.225.170(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0n
node201705
 
华东 1 可用区 F	
118.31.168.173(公)
10.135.196.237(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor07
node201705
 
华东 1 可用区 F	
118.31.169.18(公)
10.135.197.38(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor08
node201705
 
华东 1 可用区 B	
118.31.113.75(公)
10.46.224.58(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0i
node201705
 
华东 1 可用区 B	
118.31.112.25(公)
10.46.226.1(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0h
node201705
 
华东 1 可用区 F	
118.31.168.118(公)
10.135.196.238(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor02
node201705
 
华东 1 可用区 F	
118.31.168.218(公)
10.135.196.235(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor01
node201705
 
华东 1 可用区 B	
118.31.113.97(公)
10.46.225.97(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor00
node201705
 
华东 1 可用区 F	
118.31.168.227(公)
10.135.196.230(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0f
node201705
 
华东 1 可用区 F	
118.31.168.228(公)
10.135.197.48(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor06
node201705
 
华东 1 可用区 B	
118.31.113.189(公)
10.46.225.217(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0a
node201705
 
华东 1 可用区 F	
118.31.184.13(公)
10.28.150.189(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor03
node201705
 
华东 1 可用区 E	
101.37.85.3(公)
10.29.186.213(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0d
node201705
 
华东 1 可用区 E	
101.37.38.90(公)
10.29.186.45(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0j
node201705
 
华东 1 可用区 F	
118.31.168.119(公)
10.135.197.10(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0c
node201705
 
华东 1 可用区 B	
118.31.112.234(公)
10.46.225.117(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0k
node201705
 
华东 1 可用区 F	
118.31.169.24(公)
10.135.196.253(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0g
node201705
 
华东 1 可用区 F	
118.31.168.164(公)
10.135.197.4(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor04
node201705
 
华东 1 可用区 E	
101.37.85.195(公)
10.28.147.32(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor09
node201705
 
华东 1 可用区 F	
118.31.168.225(公)
10.135.196.82(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0l
node201705
 
华东 1 可用区 F	
118.31.168.101(公)
10.135.196.224(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0p
node201705
 
华东 1 可用区 B	
118.31.113.153(公)
10.46.224.85(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0o
node201705
 
华东 1 可用区 B	
118.31.113.184(公)
10.46.225.196(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多
	
i-bp1c57gfl6i9z9vlor0b
node201705
 
华东 1 可用区 E	
101.37.80.83(公)
10.29.196.61(内)
 运行中	
经典网络
CPU： 1核    内存：1 GB (I/O优化)
5Mbps（峰值）
按量
17-08-20 20:59释放
管理 | 远程连接
更多`;

console.log(html.match(/\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\(公\)/g));